src/InformationRegisters/Спец_ЗарегистрированныеОбъектыДляОбмена_Ссылки/Спец_ЗарегистрированныеОбъектыДляОбмена_Ссылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Спец_ЗарегистрированныеОбъектыДляОбмена_Ссылки</name>
  <comment>Зарегистрированные ссылочные объекты для обменов с другими базами</comment>
  <resources>
    <name>ПолноеИмяОбъектаМетаданных</name>
    <type>
      <types>DefinedType.Спец_ИмяОбъектаБазы</types>
    </type>
  </resources>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.Спец_Базы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>UnixTimestamp</name>
    <type>
      <types>DefinedType.Спец_UnixTimestamp</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Спец_ЗарегистрированныеОбъектыДляОбмена_Ссылки/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// ++ Спец_БСП.Версия1С_19_Ниже
	Список.Параметры.УстановитьЗначениеПараметра("СмещениеЧасовогоПояса", СмещениеСтандартногоВремени());
	// -- Спец_БСП.Версия1С_19_Ниже
	
	СоздатьКрасивуюПанельОтборов();
	Спец_РаботаСФормами.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Спец_РаботаСФормамиКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ОбработкаСобытияОтбора(Элемент, СтандартнаяОбработка = Истина)
	
	Спец_РаботаСФормамиКлиент.ОбработатьСобытиеОтбора(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьКрасивуюПанельОтборов()
	
	СтруктураПараметровПанели = Спец_РаботаСФормами.НоваяСтруктураПараметровВыводаПанелиКрасивыхОтборов(Элементы.Список,
			Элементы.НастройкаСписка,
			Элементы.СписокКомпоновщикНастроекПользовательскиеНастройки);
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ДатаРегистрации",
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
			"Дата регистрации",
			Истина,
			Спец_ОбщегоНазначенияКлиентСервер.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"База",
			ВидСравненияКомпоновкиДанных.Равно,
			"База");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"Объект",
			ВидСравненияКомпоновкиДанных.Равно,
			"Объект");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"ПолноеИмяОбъектаМетаданных",
			ВидСравненияКомпоновкиДанных.Равно,
			"Полное имя метаданных");
	
	Спец_РаботаСФормами.ДобавитьНовыйОтборНаПанель(СтруктураПараметровПанели,
			"Приоритет",
			ВидСравненияКомпоновкиДанных.Равно,
			"Приоритет");
	
	Спец_РаботаСФормами.ВывестиПанельОтборовНаФорму(ЭтотОбъект, СтруктураПараметровПанели);
	
КонецПроцедуры

#КонецОбласти
